Tekla Open API Reference for Tekla Structures 2025
LoadArea.LoadForm Property
 The load form.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoadArea.AreaLoadFormEnum LoadForm { get; set; }
Public Property LoadForm As LoadArea.AreaLoadFormEnum
	Get
	Set
Property Value
Type: LoadArea.AreaLoadFormEnum
See Also
Reference
LoadArea Class
Tekla.Structures.Model Namespace